# 主要属性Y1=（96.4-0.0035*a）*X+0.2886*a-26.26，代入成长和主要资质；
# 次要属性Y2=（96.4-0.0035*a）*X+0.2886*a-26.26，代入成长和次要资质；
# 评分 = Y1/1698*66.7+Y2/1693*33.3



# x = input("请输入宠物成长率：")
# y = input("请输入主资质点：")
# y2 = input("请输入副资质点：")
# x = float(x)
# y = float(y)
# y2 = float(y2)
# Y1 = (96.4-0.0035*y)*x+0.2886*y-26.26
# Y2 = (96.4-0.0035*y2)*x+0.2886*y2-26.26
# z = Y1/1698*66.7 + Y2/1693*33.3
# print("属性数值为：" ,z)
import easygui
def score(x,y,y2):
    x = float(x)
    y = float(y)
    y2 = float(y2)
    Y1 = (96.4 - 0.0035 * y) * x + 0.2886 * y - 26.26
    Y2 = (96.4 - 0.0035 * y2) * x + 0.2886 * y2 - 26.26
    z = Y1 / 1698 * 66.7 + Y2 / 1693 * 33.3
    # easygui.msgbox(msg=('评分为：', z), title='计算结果：')
    s = easygui.buttonbox(msg=('该属性为：', z), title='计算结果', choices=('再来一次', '结束'))
    return s
    # print("属性数值为：", z)
